export const softwares = [
  {
    id: "2021SR1984546",
    name: "工程环境下的安全急救系统（APP版）V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1616722",
    name: "多智能体系统一致性可视化仿真平台V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1984541",
    name: "QG云盘软件（移动版）V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1984561",
    name: "QG图数据挖掘算法可视化系统V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1984543",
    name: "QG抗疫系统（移动版）V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1984570",
    name: "QG抗疫系统（网页版）V1.0",
    time: "未发表",
  },
  {
    id: "2022SR0059816",
    name: "ForWhale软件V1.1",
    time: "未发表",
  },
  {
    id: "2021SR1984540",
    name: "API管理平台V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1754284",
    name: "智能车辆协调仿真平台V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1984547",
    name: "智能表单约束系统V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1754288",
    name: "数据挖掘可视化系统V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1984548",
    name: "基于网络拓扑及告警的故障根因定位系统V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1754285",
    name: "基于强化学习的十字路口多车道车辆仿真系统V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1754289",
    name: "基于民航统计报告的知识图谱构建与语义查询系统V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1754287",
    name: "基于出租车大数据的分析与预测系统（移动版）V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1754286",
    name: "基于出租车大数据的分析与预测系统（网页版）V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1616724",
    name: "基于编程知识教学的互动性应用学生端软件（移动版）V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1616725",
    name: "基于编程知识教学的互动性应用教师端平台（网页版）V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1616723",
    name: "基于编程知识的教学互动性应用学生端平台（网页版）V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1984549",
    name: "基于安康打卡的数据可视化分析系统（移动版）V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1984544",
    name: "基于安康打卡的数据可视化分析系统（网页版）V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1984545",
    name: "候鸟的奇妙冒险软件V1.0",
    time: "未发表",
  },
  {
    id: "2021SR1984542",
    name: "工程环境下的安全急救系统V1.0",
    time: "未发表",
  },
  {
    id: "2020SR0228147",
    name: "基于出租车大数据的城市区域吸引力排名分析系统V1.0",
    time: "2020/3/28",
  },
  {
    id: "2020SR0227393",
    name: "基于出租车大数据的城市区域分析与预测系统（移动版）V1.0",
    time: "2020/3/27",
  },
  {
    id: "2020SR0227322",
    name: "基于出租车大数据的城市区域分析与预测系统（网页版）V1.0",
    time: "2020/3/27",
  },
  {
    id: "2020SR0227387",
    name: "QG行程智能推荐系统V1.0",
    time: "2020/3/27",
  },
  {
    id: "2019SR0056715",
    name: "基于HBase存储的出租车大数据分析与可视化系统V1.0",
    time: "2019/1/5",
  },
  {
    id: "2019SR0056742",
    name: "出租车大数据分析与预测系统（移动版）V1.0",
    time: "2019/1/5",
  },
  {
    id: "2019SR0057336",
    name: "出租车大数据分析与预测系统（网页版）V1.0",
    time: "2019/1/5",
  },
  {
    id: "2019SR0056729",
    name: "电网企业用户月度用电量分析与预警系统V1.0",
    time: "2019/1/5",
  },
  {
    id: "2019SR0056699",
    name: "QG电影推荐系统V1.0",
    time: "2019/1/5",
  },
  {
    id: "2019R11L764570",
    name: "智能行李箱系统",
    time: "2019/6/21",
  },
  {
    id: "2019R11L764459",
    name: "智能家庭监控小车系统",
    time: "2019/6/21",
  },
  {
    id: "2019R11L764342",
    name: "一种环境监测系统",
    time: "2019/6/21",
  },
  {
    id: "2019R11L581717",
    name: "习题测评教师端系统",
    time: "2019/6/21",
  },
  {
    id: "2019R11L775483",
    name: "一种并行打印集群系统",
    time: "2019/6/21",
  },
  {
    id: "2019R11L581718",
    name: "基于云端的学生评测系统",
    time: "2019/6/21",
  },
  {
    id: "2019R11L582995",
    name: "基于人脸识别的颜值估算系统",
    time: "2019/6/21",
  },
  {
    id: "2019R11L586101",
    name: "智能避障眼镜配套APP软件",
    time: "2019/6/21",
  },
  {
    id: "2019R11L581716",
    name: "AnyWork移动测评系统",
    time: "2019/6/21",
  },
  {
    id: "2017SR267145",
    name: "订单集群打印系统V1.0",
    time: "2017年03月26日",
  },
  {
    id: "2017SR385752",
    name: "康复训练及评估系统V1.0",
    time: "2017年04月01日",
  },
  {
    id: "2017SR385305",
    name: "康复训练及评估系统移动管理系统",
    time: "2017年04月01日",
  },
  {
    id: "2017SR274774",
    name: "微型打印控制系统V1.0",
    time: "2016年12月31日",
  },
  {
    id: "2017SR274760",
    name: "移动订单管理及打印系统V1.0",
    time: "2017年03月16日",
  },
  {
    id: "2017SR288722",
    name: "智能急救头盔APP软件V1.0",
    time: "2017年03月16日",
  },
  {
    id: "2017SR287905",
    name: "智能急救头盔系统V1.0",
    time: "2017年03月16日",
  },
  {
    id: "2011R11L029047",
    name: "建筑楼宇声光质量检测模拟系统",
    time: "2017年03月16日",
  },
  {
    id: "2011SR071360",
    name: "企业缴费一卡通综合管理平台软件",
    time: "2017年03月16日",
  },
  {
    id: "2010SR000003",
    name: "质量计量信息一体化管理平台软件",
    time: "2017年03月16日",
  },
  {
    id: "2009SR061272",
    name: "3D虚拟场景编辑系统",
    time: "2017年03月16日",
  },
  {
    id: "2009SR061274",
    name: "数字化虚拟场景实时漫游系统",
    time: "2017年03月16日",
  },
];
