const x_about = [
    "2005年创建QG科技创新团队、第一指导教师",
    "个人共获各类省、市、校奖项40多项",
    "获得广东省教育教学成果奖（高等教育）一等奖",
    "主持和参加国家自然基金等各类科研项目30余项",
    "已申请专利和软件著作权近60项",
    "指导学生获各类科技竞赛奖项240余项（国家级33项、省级131项）",
    "广东工业大学 “学生最喜爱的教师”",
    "广东工业大学 “十佳授课教师”",
    "广东工业大学 “师德标兵”",
    "广东工业大学 “五四青年奖章”"
];
const x_academic = [
    "中国人工智能学会知识工程与分布智能专业委员会青年委员",
    "中国人工智能学会科普工作委员会委员",
    "CCF计算机应用专业委员会通信委员",
    "广东省青年科学家协会第四届理事",
    "广东省电子政务大数据专家委员会专家",
    "广东省计算机学会大数据委员会委员",
    "CCF YOCSEF 广州委员"
];
const li_about = [
    "2005年至今担任QG科技创新团队指导教师",
    "持和参加国家自然科学基金、省市科技等各类项目13项",
    "获专利授权10项，其中发明专利1项",
    "在国际期刊、会议和核心期刊发表论文10多篇",
    "个人共获各类省、市、校奖项30多项",
    "被评选为广东工业大学 “十佳授课教师”",
    "指导学生获各类科技竞赛奖项100多项"
];
const li_academic = [
  "CCF YOCSEF 广州委员","中关村大数据产业联盟会员","广东省计算机学会大数据专业委员会委员","中关村大数据联盟“大数据100分”论坛讲者"
];
const x_job = ['教授','硕士生导师','计算机学院副院长'];
const l_job = ['教授','硕士生导师'];
export {x_about,x_academic,li_about,li_academic,x_job,l_job}